content/teaching/index.org
#+TITLE:  Venkatesh Choppella Teaching
#+SETUPFILE: ../org-templates/level-1.org

* Menu
 :PROPERTIES:
   :HTML_CONTAINER_CLASS: menu
   :CUSTOM_ID: menu
 :END:

  - [[../index.org][home]]
  - [[../research/index.org][research]]
  - [[../teaching/index.org][teaching]]
  - [[../biography/index.org][biography]]
  - [[../contact/index.org][contact]]
  - [[../calendar/index.org][calendar]]


 
* Teaching
  :properties:
    :html_container_class: main
    :custom_id: main
  :END:

* Submenu
 :PROPERTIES:
   :HTML_CONTAINER_CLASS: sub-menu
   :CUSTOM_ID: sub-menu-research
 :END:

 - [[Monsoon 2019][monsoon 2019]]

 - [[Past courses][past courses]]

 - [[Short courses/workshops][short courses/workshops]]



* Monsoon 2019
    - [[http://faculty.iiit.ac.in/~vxc/afl/][Automata Theory]]
    - [[http://faculty.iiit.ac.in/~vxc/popl][Principles of Programming Languages]]


* COMMENT Spring 2019
    - [[http://faculty.iiit.ac.in/home/~venkatesh.choppella/afl/][Formal Methods (Automata and Formal Languages)]]
* COMMENT Monsoon 2018 

    - [[http://faculty.iiit.ac.in/~venkatesh.choppella/popl][Principles of Programming Languages]]

   -  [[http://faculty.iiit.ac.in/~venkatesh.choppella/aps][Advanced Problem Solving]]

* Past courses
  - Principles of Programming Languages ::   Monsoon 2018,
       2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009.

  - Interpreters and Compilers :: Spring 2004, IIITM-K

  - Software Foundations ::
      Spring 2016, 2015 (co-instructor with Prof. Suresh Purini).

  - Semantics of Programming Languages ::
      Spring 2014, 2013

  - Topics in Programming Languages ::
      Spring 2012

  - IT Workshop 2 ::
      Spring 2017, 2011, 2010 at IIITH.

  -  Web Technologies (all at IIITM-K) ::
      Fall 2008 ([[./courses/ay-2008-2009-sem1-webtech/ay-2008-2009-sem1-webtech-feedback.pdf][feedback]]), 2007([[./courses/ay-2007-2008-sem1-webtech/course-feedback.pdf][course feedback]] | [[./courses/ay-2007-2008-sem1-webtech/instr-feedback.pdf][instructor feedback]]),
	  2006, ([[./courses/ay-2006-2007-sem1-webtech/course-feedback.pdf][course feedback]] |  [[./courses/ay-2006-2007-sem1-webtech/instr-feedback.pdf][instructor feedback]] | [[./courses/ay-2006-2007-sem1-webtech/report.html][course report by instructor]]),
      Winter 2003. 

  - Advanced Web Technologies ::
      Spring 2004, IIITM-K

  - Advanced Problem Solving ::
	   [[http://pascal.iiit.ac.in/~venkatesh.choppella/aps][Monsoon 2018]]

  - Computer Problem Solving ::
      Monsoon 2015, IIIT Hyderabad ([[./courses/2015-monsoon-iiit-cps/feedback.pdf][feedback]]).

  - Programming Application Software ::
      Fall 2009, IIIT Bangalore   


** Other courses

  -  Data Structures and Algorithms ::
      Spring 2009, IIITM Kerala

  -  Computational Biology ::
      Fall 2007, (co-instructor), IIITM-K

  -  Scientific Computing ::
      Fall 2006 (co-instructor), IIITM-K

  -  Database Systems ::
      Spring 2006, 2005 (co-instructor), IIITM-K

  -  Mathematical Foundations of Information Technology ::
      Winter 2004, IIITM-K


* Short courses/workshops
  
  - Git Version Control :: 3 day short course July
       24th--26th, 2017 at DRDO Hyderabad.

  - Virtual Labs on the College Cloud :: 2
       day workshop for college teachers  May 9th--10th 2017
       at JUIT, Waknaghat, Himachal Pradesh. 

  - Building a web application from Ground Up to the Cloud :: 3
       week short course May 16th-Jun 4th 2016 for Virtual
       Labs summer interns at IIIT-H.

  - Dynamical Systems, Automata and Functional Programming :: 2
       day short course at Goa University Academic Staff
       College (ASC) for college teachers.  13-14 Jan, 2014,
       Goa.

  - Mapcode and Computer Problem Solving ::  3 day short
       course for College Teachers at VNR Vignan Jyothi
       College, Hyderabad.  May 27-29, 2013, Hyderabad.
       (co-instructor with Prof. KV Nori and Prof. K
       Swath).

  - Practical Program Verification :: 4 day short course
       under the Tata Excellence in Computer Science (TECS)
       Programme, TCS Hyderabad, 14-18th February, 2008
       (Session on Day 1 on "Verification in the PVS theorem
       prover".)


   - Principles of Programming for the Web :: 11 day short
        course for Andhra Pradesh College Teachers under the
        Govt. India TEQIP Project organized by Enhance Edu.
        May 3-13, 2010, IIIT Hyderabad.


* COMMENT Old
** 2009 Aug - Dec: Programming Application Software Principal Instructor

[[http://wiki.iiitb.ac.in/mediawiki/index.php//_SE_101_Programming_Application_Software][ course pages ]]


** 2009 Aug - Oct: Principles of Programming Languages Co-Instructor


** 2009 Jan - Apr: Data Structures and Algorithms Principal Instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2008-2009/Sem-2/ITM107_Data_Structures_and_Algorithms][ course pages ]]


** 2008 Aug - Dec: Web Technologies Principal Instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2008-2009/Sem-1/ITM_112_Web_Technology][ course pages ]] |


** 2008 May - Jul: Computer Networks Associate Instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2007-2008/Summer/ITM108_Computer_Networks][ course pages ]]


** 2008 Feb: Practical Program Verification Co-Instructor

Short course under the Tata Excellence in Computer Science (TECS) Programme, Hyderabad, February 2008. 
[[http://www.iiitmk.ac.in/~venkatesh.choppella/teaching/ppv][ course pages ]]


** 2007 Sep - Dec: Web Technologies Principal Instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2007-2008/Sem-1/Web_Technologies][ course pages ]] | 
** 2007 Sep - Dec: Computational Biology Co-instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2007-2008/Sem-1/Computational_Biology][ course pages ]] | [[./courses/ay-2007-2008-sem1-comp-bio/grammars.pdf][ notes on grammars]]


** 2007 Aug - Dec: Principles of Programming Principal Instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2007-2008/Sem-1/Principles_of_Programming][ course pages ]] | [[./courses/ay-2007-2008-sem1-pop/course-feedback.pdf][ student feedback on course (pdf) ]] | [[./courses/ay-2007-2008-sem1-pop/instr-feedback.pdf][ student feedback on instructor (pdf) ]]


** 2007 Jan - Apr: Principles of Programming Principal Instructor

[[http://www.iiitmk.ac.in/wiki/index.php/AY_2006-2007/Sem-2/Principles_of_Programming][ course pages ]] | [[./courses/ay-2006-2007-sem2-pop/course-feedback.pdf][ student feedback on course (pdf) ]] | [[./courses/ay-2006-2007-sem2-pop/instr-feedback.pdf][ student feedback on instructor (pdf) ]] | [[courses/ay-2006-2007-sem2-pop/report.html][ course report by instructor ]]


** 2006 Aug - Dec : Scientific Computing Associate Instructor

** 2006 Jan - Mar : Database Systems Co-instructor

** 2005 Jan - Apr: Database Systems Co-instructor

** 2004 Jul - Sep: Mathematical Foundations of IT Principal Instructor

** 2004 Mar - Jun: Interpreters and Compilers Principal Instructor

[[http://www.iiitmk.ac.in/~courses/itm308/2004-spring/index.html][ course pages ]]

** 2004 Mar - Jul: Advanced Web Technologies Co-instructor

** 2003 Nov - 2004 Mar: Web Technologies Principal Instructor

[[http://www.iiitmk.ac.in/~courses/itm203/2003-winter/index.html][ course pages ]]








