content/teaching/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-03 Sun 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Venkatesh Choppella Teaching</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Venkatesh Choppella" />
<link rel="stylesheet" type="text/css" href="../style/css/main.css" />
<link href='http://fonts.googleapis.com/css?family=Gloria+Hallelujah' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Venkatesh Choppella Teaching</h1>

<div id="outline-container-org9db8c6f" class="outline-2 menu">
<h2 id="menu"><a id="org9db8c6f"></a>Menu</h2>
<div class="outline-text-2" id="text-menu">
<ul class="org-ul">
<li><a href="../index.html">home</a></li>
<li><a href="../research/index.html">research</a></li>
<li><a href="../teaching/index.html">teaching</a></li>
<li><a href="../biography/index.html">biography</a></li>
<li><a href="../contact/index.html">contact</a></li>
<li><a href="../calendar/index.html">calendar</a></li>
</ul>
</div>
</div>



<div id="outline-container-org3b7639a" class="outline-2 main">
<h2 id="main"><a id="org3b7639a"></a>Teaching</h2>
<div class="outline-text-2" id="text-main">
</div>
</div>

<div id="outline-container-org622ee6a" class="outline-2 sub-menu">
<h2 id="sub-menu-research"><a id="org622ee6a"></a>Submenu</h2>
<div class="outline-text-2" id="text-sub-menu-research">
<ul class="org-ul">
<li><a href="#org6665dbd">monsoon 2019</a></li>

<li><a href="#orgdfbe5e1">past courses</a></li>

<li><a href="#org1c7f53d">short courses/workshops</a></li>
</ul>
</div>
</div>



<div id="outline-container-org6665dbd" class="outline-2">
<h2 id="org6665dbd">Monsoon 2019</h2>
<div class="outline-text-2" id="text-org6665dbd">
<ul class="org-ul">
<li><a href="http://faculty.iiit.ac.in/~vxc/afl/">Automata Theory</a></li>
<li><a href="http://faculty.iiit.ac.in/~vxc/popl">Principles of Programming Languages</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgdfbe5e1" class="outline-2">
<h2 id="orgdfbe5e1">Past courses</h2>
<div class="outline-text-2" id="text-orgdfbe5e1">
<dl class="org-dl">
<dt>Principles of Programming Languages</dt><dd>Monsoon 2018,
2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009.</dd>

<dt>Interpreters and Compilers</dt><dd>Spring 2004, IIITM-K</dd>

<dt>Software Foundations</dt><dd>Spring 2016, 2015 (co-instructor with Prof. Suresh Purini).</dd>

<dt>Semantics of Programming Languages</dt><dd>Spring 2014, 2013</dd>

<dt>Topics in Programming Languages</dt><dd>Spring 2012</dd>

<dt>IT Workshop 2</dt><dd>Spring 2017, 2011, 2010 at IIITH.</dd>

<dt>Web Technologies (all at IIITM-K)</dt><dd>Fall 2008 (<a href="./courses/ay-2008-2009-sem1-webtech/ay-2008-2009-sem1-webtech-feedback.pdf">feedback</a>), 2007(<a href="./courses/ay-2007-2008-sem1-webtech/course-feedback.pdf">course feedback</a> | <a href="./courses/ay-2007-2008-sem1-webtech/instr-feedback.pdf">instructor feedback</a>),
    2006, (<a href="./courses/ay-2006-2007-sem1-webtech/course-feedback.pdf">course feedback</a> |  <a href="./courses/ay-2006-2007-sem1-webtech/instr-feedback.pdf">instructor feedback</a> | <a href="./courses/ay-2006-2007-sem1-webtech/report.html">course report by instructor</a>),
Winter 2003.</dd>

<dt>Advanced Web Technologies</dt><dd>Spring 2004, IIITM-K</dd>

<dt>Advanced Problem Solving</dt><dd><a href="http://pascal.iiit.ac.in/~venkatesh.choppella/aps">Monsoon 2018</a></dd>

<dt>Computer Problem Solving</dt><dd>Monsoon 2015, IIIT Hyderabad (<a href="./courses/2015-monsoon-iiit-cps/feedback.pdf">feedback</a>).</dd>

<dt>Programming Application Software</dt><dd>Fall 2009, IIIT Bangalore</dd>
</dl>
</div>


<div id="outline-container-org653b7d7" class="outline-3">
<h3 id="org653b7d7">Other courses</h3>
<div class="outline-text-3" id="text-org653b7d7">
<dl class="org-dl">
<dt>Data Structures and Algorithms</dt><dd>Spring 2009, IIITM Kerala</dd>

<dt>Computational Biology</dt><dd>Fall 2007, (co-instructor), IIITM-K</dd>

<dt>Scientific Computing</dt><dd>Fall 2006 (co-instructor), IIITM-K</dd>

<dt>Database Systems</dt><dd>Spring 2006, 2005 (co-instructor), IIITM-K</dd>

<dt>Mathematical Foundations of Information Technology</dt><dd>Winter 2004, IIITM-K</dd>
</dl>
</div>
</div>
</div>


<div id="outline-container-org1c7f53d" class="outline-2">
<h2 id="org1c7f53d">Short courses/workshops</h2>
<div class="outline-text-2" id="text-org1c7f53d">
<dl class="org-dl">
<dt>Git Version Control</dt><dd>3 day short course July
24th&#x2013;26th, 2017 at DRDO Hyderabad.</dd>

<dt>Virtual Labs on the College Cloud</dt><dd>2
day workshop for college teachers  May 9th&#x2013;10th 2017
at JUIT, Waknaghat, Himachal Pradesh.</dd>

<dt>Building a web application from Ground Up to the Cloud</dt><dd>3
week short course May 16th-Jun 4th 2016 for Virtual
Labs summer interns at IIIT-H.</dd>

<dt>Dynamical Systems, Automata and Functional Programming</dt><dd>2
day short course at Goa University Academic Staff
College (ASC) for college teachers.  13-14 Jan, 2014,
Goa.</dd>

<dt>Mapcode and Computer Problem Solving</dt><dd>3 day short
course for College Teachers at VNR Vignan Jyothi
College, Hyderabad.  May 27-29, 2013, Hyderabad.
(co-instructor with Prof. KV Nori and Prof. K
Swath).</dd>

<dt>Practical Program Verification</dt><dd>4 day short course
under the Tata Excellence in Computer Science (TECS)
Programme, TCS Hyderabad, 14-18th February, 2008
(Session on Day 1 on "Verification in the PVS theorem
prover".)</dd>
</dl>


<dl class="org-dl">
<dt>Principles of Programming for the Web</dt><dd>11 day short
course for Andhra Pradesh College Teachers under the
Govt. India TEQIP Project organized by Enhance Edu.
May 3-13, 2010, IIIT Hyderabad.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Venkatesh Choppella</p>
<p class="date">Created: 2023-12-03 Sun 19:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
